{
  "backend/main.mo": "Implements access-controlled user profiles and messaging with conversations stored in maps and utilities for sorting and profile management.",
  "feature_evidence.json": "Defines feature evidence metadata linking deployment-related files, components, and tests for build validation.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including components, hooks, utilities, and deployment docs.",
  "frontend/DEPLOYMENT.md": "Runbook outlining prerequisites, checks, and steps for building and deploying the frontend to production.",
  "frontend/index.css": "Tailwind base styles and custom color variables for light and dark mode themes.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/scripts/live-smoke-checklist.md": "Live environment smoke test checklist covering authentication, UI validation, profile setup, and messaging flows.",
  "frontend/src/App.tsx": "Root React component handling authentication state, profile gating, and rendering the chat layout.",
  "frontend/src/components/CurrentUserHeaderAvatar.tsx": "Displays the current user's avatar or a fallback app icon in various sizes.",
  "frontend/src/features/auth/AuthScreen.tsx": "Login landing page with branding, feature highlights, and Internet Identity authentication.",
  "frontend/src/features/chat/ChatDetail.tsx": "Renders a chat conversation's messages with auto-scroll, sender highlighting, timestamps, and a message composer.",
  "frontend/src/features/chat/ChatLayout.tsx": "Manages the main chat UI layout including sidebar, conversation selection, new chat flow, and logout handling.",
  "frontend/src/features/chat/ChatList.tsx": "Displays a scrollable list of conversations showing participants, last message, and relative timestamps.",
  "frontend/src/features/chat/MessageComposer.tsx": "Provides a text area and send button for composing and sending messages with auto-resizing input.",
  "frontend/src/features/chat/NewChat.tsx": "Allows starting a new chat by entering a Principal ID with validation and error handling.",
  "frontend/src/features/profile/ProfileSetupDialog.tsx": "Modal dialog for setting up a user profile including name and optional avatar upload.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, conversations, messages, and mutations using the authenticated actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables and defines chat bubble component styles.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/utils/avatarImage.ts": "Validates an image file and converts it to a data URL for avatar usage.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session-stored parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and plugins using CSS variables.",
  "project_state.json": "Defines the project’s current state, existing features, architectural notes, and versioning for a WhatsApp-like app. Lists implemented features, design requirements, and profile/avatar behavior rules."
}